Revit 2024 API
ScheduleDefinition.CanIncludeLinkedFiles Method
 Checks whether the schedule is a type that supports including elements from linked files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanIncludeLinkedFiles()
Visual Basic
Public Function CanIncludeLinkedFiles As Boolean
Visual C++
public:
bool CanIncludeLinkedFiles()
Return Value
 True if elements from linked files can be included, false otherwise.
Remarks
 Elements from linked files can be included in schedules of normal model elements and in sheet lists, but not in most other specialized kinds of schedules.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace